codeigniter4/app/Controllers/AuthController.php

SELECT *
FROM `prefixes`
WHERE `code` = '034'
 LIMIT 1
---
    public function loginPost()
    {
        $telephone = trim($this->request->getPost('telephone'));

        if (empty($telephone)) {
            return redirect()->back()->withInput()->with('error', 'Veuillez entrer un numéro de téléphone.');
        }

        // Extraire le préfixe (3 premiers chiffres)
        if (strlen($telephone) < 3) {
            return redirect()->back()->withInput()->with('error', 'Numéro de téléphone trop court.');
        }

        $prefixe = substr($telephone, 0, 3);

        // Vérifier que le préfixe existe dans la base
        $prefixeExist = $this->prefixesModel->where('code', $prefixe)->first();