codeigniter4/app/Controllers/PrefixesController.php

SELECT *
FROM `prefixes`
ORDER BY `code` ASC
---
    public function index()
    {
        $data = [
            'prefixes' => $this->prefixesModel->orderBy('code', 'ASC')->findAll(),
            'title'    => 'Gestion des Préfixes',
        ];