codeigniter4/app/Models/ClientsModel.php

SELECT *
FROM `clients`
WHERE `telephone` = '0341271582'
 LIMIT 1
---
    public function findByTelephone($telephone)
    {
        return $this->where('telephone', $telephone)->first();